kylefoxaustin/mcxn947qemu/hw/usb/mcxn_usbdev.c
/*
 * NXP MCX N USB device-mode core — usbredir-server bridge.
 *
 * See include/hw/usb/mcxn_usbdev.h for the design.  This file owns the usbredir
 * wire (libusbredirparser) and the chardev bridge; the controller backends
 * (KHCI/ChipIdea) register via mcxn_usbdev_set_backend() and supply the
 * endpoint engine.  We play the usbredir "host" role (we export a device); the
 * remote peer is a stock `-device usb-redir` client.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qapi/error.h"
#include "chardev/char-fe.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-properties-system.h"
#include "hw/usb/mcxn_usbdev.h"
#include "migration/vmstate.h"
#include "qom/object.h"

#include <usbredirparser.h>

#define USBDEV_VERSION "qemu mcxn-usbdev " QEMU_VERSION


/*
 * ------------------------------------------------------------------------- *
 * chardev <-> usbredirparser bridge (mirrors hw/usb/redirect.c).
 * ------------------------------------------------------------------------- *
 */

static int usbdev_read(void *priv, uint8_t *data, int count)
{
    MCXNUsbDevState *s = priv;

    if (s->read_buf_size < count) {
        count = s->read_buf_size;
    }
    if (count) {
        memcpy(data, s->read_buf, count);
        s->read_buf_size -= count;
        if (s->read_buf_size) {
            s->read_buf += count;
        } else {
            s->read_buf = NULL;
        }
    }
    return count;
}

static gboolean usbdev_write_unblocked(void *do_not_use, GIOCondition cond,
                                       void *opaque)
{
    MCXNUsbDevState *s = opaque;

    s->watch = 0;
    usbredirparser_do_write(s->parser);
    return FALSE;
}

static int usbdev_write(void *priv, uint8_t *data, int count)
{
    MCXNUsbDevState *s = priv;
    int r;

    if (!qemu_chr_fe_backend_open(&s->cs)) {
        return 0;
    }

    r = qemu_chr_fe_write(&s->cs, data, count);
    if (r < count) {
        if (!s->watch) {
            s->watch = qemu_chr_fe_add_watch(&s->cs, G_IO_OUT | G_IO_HUP,
                                             usbdev_write_unblocked, s);
        }
        if (r < 0) {
            r = 0;
        }
    }
    return r;
}

static void usbdev_log(void *priv, int level, const char *msg)
{
    qemu_log_mask(LOG_GUEST_ERROR, "mcxn-usbdev: %s\n", msg);
}

/*
 * ------------------------------------------------------------------------- *
 * Endpoint-slot helpers + pending-request tracking.
 * ------------------------------------------------------------------------- *
 */

static int usbdev_slot(uint8_t ep_addr)
{
    return (ep_addr & 0x0f) | ((ep_addr & 0x80) ? 0x10 : 0);
}

static MCXNUsbPending *usbdev_pending(MCXNUsbDevState *s, uint8_t ep_addr)
{
    return &s->pending[usbdev_slot(ep_addr)];
}

/*
 * ------------------------------------------------------------------------- *
 * Device-side receive callbacks — forward host transfers to the controller
 * backend (guest firmware), reply over usbredir (sync or async).
 * ------------------------------------------------------------------------- *
 */

static void usbdev_hello(void *priv, struct usb_redir_hello_header *h)
{
    MCXNUsbDevState *s = priv;

    s->connected = true;
    /*
     * If firmware already enabled the controller before the peer connected,
     * (re)announce the device now that the handshake is complete.
     */
    if (s->attached && s->parser) {
        mcxn_usbdev_attach(s, s->speed);
    }
}

static void usbdev_reset(void *priv)
{
    MCXNUsbDevState *s = priv;

    memset(s->pending, 0, sizeof(s->pending));
    /*
     * A USB bus reset reverts the device to the default (addr 0) state.
     * Signal it to the backend so guest firmware re-inits its endpoints —
     * required for a reused server to re-enumerate a fresh client.
     */
    if (s->be_ops && s->be_ops->bus_reset) {
        s->be_ops->bus_reset(s->be);
    }
    qemu_log_mask(LOG_GUEST_ERROR, "mcxn-usbdev: host bus reset\n");
}

/*
 * SET_CONFIGURATION / GET_CONFIGURATION / SET_INTERFACE / GET_INTERFACE arrive
 * as dedicated usbredir messages (not control_packets) from a real importer
 * (hw/usb/redirect.c sends usbredirparser_send_set_configuration etc.).  Drive
 * the no-data ones into the controller as a synthesized EP0 SETUP so guest
 * firmware transitions to Configured / selects the alt setting and arms its
 * endpoints, then reply with the matching status message.
 */
static void usbdev_std_setup(MCXNUsbDevState *s, uint8_t bmreq, uint8_t breq,
                             uint16_t val, uint16_t idx)
{
    uint8_t setup[8] = { bmreq, breq, val & 0xff, val >> 8,
                         idx & 0xff, idx >> 8, 0, 0 };
    if (s->be_ops) {
        s->be_ops->setup(s->be, setup);
    }
}

static void usbdev_set_configuration(void *priv, uint64_t id,
                        struct usb_redir_set_configuration_header *h)
{
    MCXNUsbDevState *s = priv;
    MCXNUsbPending *p = usbdev_pending(s, 0x00);

    /*
     * Defer configuration_status until firmware runs the SET_CONFIGURATION
     * status stage (complete_out): a real importer waits for this reply
     * before its next request, so deferring serializes the SETUPs and stops
     * the next one clobbering EP0 before firmware arms its endpoints.
     * Acking early is the CDC ttyACM write-EIO / GET_LINE_CODING=0 bug — a
     * multi-interface gadget pipelines SET_CONFIGURATION -> SET_INTERFACE
     * and the second SETUP lands before firmware has processed the first.
     */
    s->cur_config = h->configuration;
    p->active = true;
    p->is_control = true;
    p->id = id;
    p->reply_kind = MCXN_USB_REPLY_CONFIG;
    p->arg0 = h->configuration;
    usbdev_std_setup(s, 0x00, 9, h->configuration, 0);   /* SET_CONFIGURATION */
}

static void usbdev_get_configuration(void *priv, uint64_t id)
{
    MCXNUsbDevState *s = priv;
    struct usb_redir_configuration_status_header st = { 0 };

    st.status = usb_redir_success;
    st.configuration = s->cur_config;
    usbredirparser_send_configuration_status(s->parser, id, &st);
    usbredirparser_do_write(s->parser);
}

static void usbdev_set_alt_setting(void *priv, uint64_t id,
                                   struct usb_redir_set_alt_setting_header *h)
{
    MCXNUsbDevState *s = priv;
    MCXNUsbPending *p = usbdev_pending(s, 0x00);

