kylefoxaustin/mcxn947qemu/hw/usb/mcxn_usbdev.c
    /*
     * Same deferral as SET_CONFIGURATION: ack only after firmware's status
     * stage, so the importer's next SETUP can't clobber EP0.
     */
    p->active = true;
    p->is_control = true;
    p->id = id;
    p->reply_kind = MCXN_USB_REPLY_ALT;
    p->arg0 = h->interface;
    p->arg1 = h->alt;
    usbdev_std_setup(s, 0x01, 11, h->alt, h->interface);  /* SET_INTERFACE */
}

static void usbdev_get_alt_setting(void *priv, uint64_t id,
                                   struct usb_redir_get_alt_setting_header *h)
{
    MCXNUsbDevState *s = priv;
    struct usb_redir_alt_setting_status_header st = { 0 };

    st.status = usb_redir_success;
    st.interface = h->interface;
    st.alt = 0;
    usbredirparser_send_alt_setting_status(s->parser, id, &st);
    usbredirparser_do_write(s->parser);
}

/*
 * Control transfer from the host.  Build the 8-byte SETUP, hand it to the
 * backend's EP0, then move the data stage:
 *   - IN  (requesttype bit7=1): pull up to @length bytes from EP0 IN.
 *   - OUT (requesttype bit7=0): push @data_len bytes to EP0 OUT, ack status.
 * A backend that must wait for firmware returns ASYNC; we stash the request and
 * answer from mcxn_usbdev_complete_in()/_out().
 */
static void usbdev_control_packet(void *priv, uint64_t id,
                                  struct usb_redir_control_packet_header *ch,
                                  uint8_t *data, int data_len)
{
    MCXNUsbDevState *s = priv;
    uint8_t setup[8];
    bool dev_to_host = ch->requesttype & 0x80;
    int rc;

    if (!s->be_ops) {
        ch->status = usb_redir_stall;
        usbredirparser_send_control_packet(s->parser, id, ch, NULL, 0);
        usbredirparser_free_packet_data(s->parser, data);
        return;
    }

    setup[0] = ch->requesttype;
    setup[1] = ch->request;
    setup[2] = ch->value & 0xff;
    setup[3] = ch->value >> 8;
    setup[4] = ch->index & 0xff;
    setup[5] = ch->index >> 8;
    setup[6] = ch->length & 0xff;
    setup[7] = ch->length >> 8;
    s->be_ops->setup(s->be, setup);

    if (dev_to_host) {
        g_autofree uint8_t *buf = g_malloc0(ch->length ? ch->length : 1);
        int out_len = 0;

        /*
         * Register the pending request BEFORE invoking the backend: the
         * engine may complete synchronously (calling complete_in() inline),
         * which must find this request already active.
         */
        MCXNUsbPending *p = usbdev_pending(s, 0x80);
        p->active = true;
        p->is_control = true;
        p->id = id;
        p->length = ch->length;
        p->ep = 0x80;
        rc = s->be_ops->ep_in(s->be, 0, buf, ch->length, &out_len);
        if (rc != MCXN_USB_XFER_ASYNC) {
            p->active = false;
            ch->status = (rc == MCXN_USB_XFER_OK) ? usb_redir_success
                                                  : usb_redir_stall;
            usbredirparser_send_control_packet(s->parser, id, ch,
                                  rc == MCXN_USB_XFER_OK ? buf : NULL,
                                  rc == MCXN_USB_XFER_OK ? out_len : 0);
        }
    } else {
        /*
         * Host->device control.  Do NOT ack synchronously: a control transfer
         * only completes after its status stage, and acking early lets the host
         * pipeline the next SETUP — which would clobber the single in-flight
         * SETUP before firmware processes this one.  Mark it pending; the
         * backend completes it (via complete_out) once firmware runs the
         * zero-length status stage.
         */
        MCXNUsbPending *p = usbdev_pending(s, 0x00);
        p->active = true;
        p->is_control = true;
        p->id = id;
        p->ep = 0x00;
        /* slot 0 is shared with set_config/alt */
        p->reply_kind = MCXN_USB_REPLY_XFER;
        if (data_len) {
            s->be_ops->ep_out(s->be, 0, data, data_len);
        }
    }
    usbredirparser_free_packet_data(s->parser, data);
}

/* Bulk transfer from the host: forward to the addressed endpoint. */
static void usbdev_bulk_packet(void *priv, uint64_t id,
                               struct usb_redir_bulk_packet_header *bh,
                               uint8_t *data, int data_len)
{
    MCXNUsbDevState *s = priv;
    bool dev_to_host = bh->endpoint & 0x80;
    int ep = bh->endpoint & 0x0f;
    uint16_t length = bh->length | ((uint32_t)bh->length_high << 16);
    int rc;

    if (!s->be_ops) {
        bh->status = usb_redir_stall;
        bh->length = 0;
        bh->length_high = 0;
        usbredirparser_send_bulk_packet(s->parser, id, bh, NULL, 0);
        usbredirparser_free_packet_data(s->parser, data);
        return;
    }

    if (dev_to_host) {
        g_autofree uint8_t *buf = g_malloc0(length ? length : 1);
        int out_len = 0;

        /* Mark pending before the call (engine may complete inline). */
        MCXNUsbPending *p = usbdev_pending(s, bh->endpoint);
        p->active = true;
        p->is_control = false;
        p->id = id;
        p->length = length;
        p->ep = bh->endpoint;
        rc = s->be_ops->ep_in(s->be, ep, buf, length, &out_len);
        if (rc != MCXN_USB_XFER_ASYNC) {
            p->active = false;
            bh->status = (rc == MCXN_USB_XFER_OK) ? usb_redir_success
                                                  : usb_redir_stall;
            bh->length = (rc == MCXN_USB_XFER_OK) ? (out_len & 0xffff) : 0;
            bh->length_high = (rc == MCXN_USB_XFER_OK) ? (out_len >> 16) : 0;
            usbredirparser_send_bulk_packet(s->parser, id, bh,
                                  rc == MCXN_USB_XFER_OK ? buf : NULL,
                                  rc == MCXN_USB_XFER_OK ? out_len : 0);
        }
    } else {
        MCXNUsbPending *p = usbdev_pending(s, bh->endpoint);
        p->active = true;
        p->is_control = false;
        p->id = id;
        p->ep = bh->endpoint;
        rc = s->be_ops->ep_out(s->be, ep, data, data_len);
        if (rc != MCXN_USB_XFER_ASYNC) {
            p->active = false;
            bh->status = (rc == MCXN_USB_XFER_OK) ? usb_redir_success
                                                  : usb_redir_stall;
            bh->length = 0;
            bh->length_high = 0;
            usbredirparser_send_bulk_packet(s->parser, id, bh, NULL, 0);
        }
    }
    usbredirparser_free_packet_data(s->parser, data);
}

