kylefoxaustin/mcxn947qemu/hw/usb/mcxn_usbdev.c
/*
 * A real importer streams interrupt-IN endpoints via start/stop_interrupt_
 * receiving (NOT interrupt_packet).  The CDC gadget's notification endpoint
 * (EP2 IN) triggers this; we MUST register handlers or libusbredirparser
 * dispatches the message to a NULL callback and crashes.  Our gadget has no
 * notifications to report, so we just ack the (re)start and stay quiet.
 */
static void usbdev_start_interrupt_receiving(void *priv, uint64_t id,
    struct usb_redir_start_interrupt_receiving_header *h)
{
    MCXNUsbDevState *s = priv;
    struct usb_redir_interrupt_receiving_status_header st = { 0 };

    st.status = usb_redir_success;
    st.endpoint = h->endpoint;
    usbredirparser_send_interrupt_receiving_status(s->parser, id, &st);
    usbredirparser_do_write(s->parser);
}

static void usbdev_stop_interrupt_receiving(void *priv, uint64_t id,
    struct usb_redir_stop_interrupt_receiving_header *h)
{
    MCXNUsbDevState *s = priv;
    struct usb_redir_interrupt_receiving_status_header st = { 0 };

    st.status = usb_redir_success;
    st.endpoint = h->endpoint;
    usbredirparser_send_interrupt_receiving_status(s->parser, id, &st);
    usbredirparser_do_write(s->parser);
}

/*
 * Interrupt OUT (host->device) — our gadgets have no interrupt-OUT endpoint;
 * release the buffer so the parser doesn't leak.
 */
static void usbdev_interrupt_packet(void *priv, uint64_t id,
    struct usb_redir_interrupt_packet_header *h, uint8_t *data, int data_len)
{
    MCXNUsbDevState *s = priv;

    usbredirparser_free_packet_data(s->parser, data);
}

/*
 * The importer cancels an outstanding transfer (e.g. cdc_acm unlinking its
 * read URB on close): drop the matching pending so a late completion can't
 * answer a cancelled request.
 */
static void usbdev_cancel_data_packet(void *priv, uint64_t id)
{
    MCXNUsbDevState *s = priv;
    int i;

    for (i = 0; i < MCXN_USB_NSLOTS; i++) {
        if (s->pending[i].active && s->pending[i].id == id) {
            s->pending[i].active = false;
        }
    }
}

static void usbdev_device_disconnect_ack(void *priv)
{
    /* Ack of our device_disconnect; nothing to do. */
}

/*
 * ------------------------------------------------------------------------- *
 * Parser lifecycle.
 * ------------------------------------------------------------------------- *
 */

static void usbdev_create_parser(MCXNUsbDevState *s)
{
    uint32_t caps[USB_REDIR_CAPS_SIZE] = { 0 };
    struct usbredirparser *p;

    p = usbredirparser_create();
    if (!p) {
        return;
    }
    p->priv = s;
    p->log_func = usbdev_log;
    p->read_func = usbdev_read;
    p->write_func = usbdev_write;
    p->hello_func = usbdev_hello;
    p->reset_func = usbdev_reset;
    p->set_configuration_func = usbdev_set_configuration;
    p->get_configuration_func = usbdev_get_configuration;
    p->set_alt_setting_func = usbdev_set_alt_setting;
    p->get_alt_setting_func = usbdev_get_alt_setting;
    p->control_packet_func = usbdev_control_packet;
    p->bulk_packet_func = usbdev_bulk_packet;
    /*
     * Interrupt-IN streaming (CDC notification EP) + cancel/disconnect —
     * MUST be set: libusbredirparser calls the cb unconditionally
     * (NULL => crash).
     */
    p->start_interrupt_receiving_func = usbdev_start_interrupt_receiving;
    p->stop_interrupt_receiving_func = usbdev_stop_interrupt_receiving;
    p->interrupt_packet_func = usbdev_interrupt_packet;
    p->cancel_data_packet_func = usbdev_cancel_data_packet;
    p->device_disconnect_ack_func = usbdev_device_disconnect_ack;

    /*
     * We export a (virtual) device, i.e. we play the usb-host role; the
     * remote `-device usb-redir` is the client.  Advertise the standard
     * caps.
     */
    usbredirparser_caps_set_cap(caps, usb_redir_cap_connect_device_version);
    usbredirparser_caps_set_cap(caps, usb_redir_cap_ep_info_max_packet_size);

    usbredirparser_init(p, USBDEV_VERSION, caps, USB_REDIR_CAPS_SIZE,
                        usbredirparser_fl_usb_host);
    s->parser = p;
    usbredirparser_do_write(p);
}

static void usbdev_destroy_parser(MCXNUsbDevState *s)
{
    if (s->watch) {
        g_source_remove(s->watch);
        s->watch = 0;
    }
    if (s->parser) {
        usbredirparser_destroy(s->parser);
        s->parser = NULL;
    }
    s->connected = false;
}

/*
 * ------------------------------------------------------------------------- *
 * chardev event/read handlers.
 * ------------------------------------------------------------------------- *
 */

static int usbdev_chr_can_read(void *opaque)
{
    MCXNUsbDevState *s = opaque;
    return s->parser ? 1024 * 1024 : 0;
}

static void usbdev_chr_read(void *opaque, const uint8_t *buf, int size)
{
    MCXNUsbDevState *s = opaque;

    if (!s->parser) {
        return;
    }
    s->read_buf = buf;
    s->read_buf_size = size;
    usbredirparser_do_read(s->parser);
    usbredirparser_do_write(s->parser);
}

static void usbdev_chr_event(void *opaque, QEMUChrEvent event)
{
    MCXNUsbDevState *s = opaque;

    switch (event) {
    case CHR_EVENT_OPENED:
        usbdev_destroy_parser(s);
        usbdev_create_parser(s);
        break;
    case CHR_EVENT_CLOSED:
        usbdev_destroy_parser(s);
        break;
    default:
        break;
    }
}

/*
 * ------------------------------------------------------------------------- *
 * Public API.
 * ------------------------------------------------------------------------- *
 */

void mcxn_usbdev_set_backend(MCXNUsbDevState *s,
                             const MCXNUsbBackendOps *ops, void *be)
{
    s->be_ops = ops;
    s->be = be;
}

void mcxn_usbdev_attach(MCXNUsbDevState *s, uint8_t speed)
{
    struct usb_redir_interface_info_header ii = { 0 };
    struct usb_redir_ep_info_header ei = { 0 };
    struct usb_redir_device_connect_header dc = { 0 };
    int i;

    s->attached = true;
    s->speed = speed;
    if (!s->parser || !s->connected) {
        return;     /* announced once the hello handshake completes */
    }

