kylefoxaustin/mcxn947qemu/hw/usb/mcxn_usbdev.c
    /*
     * A real usb-redir *importer* (QEMU hw/usb/redirect.c
     * usbredir_check_filter) hard-requires interface_info to be set when
     * device_connect is processed, and uses ep_info to set up the
     * endpoints — so both MUST be sent before device_connect, even though
     * the descriptors themselves still flow from firmware via the
     * forwarded control transfers.  The layout must match the gadget
     * firmware's config descriptor; gadget-profile selects it.  (A future
     * cleanup could derive this from the firmware's config descriptor.)
     */
    for (i = 0; i < 32; i++) {
        ei.type[i] = usb_redir_type_invalid;
    }
    /* EP0 is always control/64; bulk max-packet is speed-coherent (HS=512). */
    uint16_t bulk_mps = (speed == usb_redir_speed_high) ? 512 : 64;
    /* EP0 OUT */
    ei.type[0]  = usb_redir_type_control; ei.max_packet_size[0]  = 64;
    /* EP0 IN  */
    ei.type[16] = usb_redir_type_control; ei.max_packet_size[16] = 64;

    if (s->gadget_profile && !strcmp(s->gadget_profile, "cdc")) {
        /*
         * CDC-ACM: interface 0 Communications/ACM + EP2-IN interrupt
         * notify; interface 1 Data + EP1 bulk in/out.  Binds Linux
         * cdc_acm.
         */
        ii.interface_count = 2;
        ii.interface[0] = 0;
        ii.interface_class[0] = 0x02;      /* Communications */
        ii.interface_subclass[0] = 0x02;   /* Abstract Control Model */
        ii.interface_protocol[0] = 0x01;   /* AT commands (V.25ter) */
        ii.interface[1] = 1;
        ii.interface_class[1] = 0x0A;      /* CDC Data */
        ii.interface_subclass[1] = 0;
        ii.interface_protocol[1] = 0;
        ei.type[18] = usb_redir_type_interrupt;  /* EP2 IN (0x82) notify */
        ei.max_packet_size[18] = 16; ei.interval[18] = 9; ei.interface[18] = 0;
        ei.type[1]  = usb_redir_type_bulk;       /* EP1 OUT data */
        ei.max_packet_size[1] = bulk_mps; ei.interface[1] = 1;
        ei.type[17] = usb_redir_type_bulk;       /* EP1 IN  data */
        ei.max_packet_size[17] = bulk_mps; ei.interface[17] = 1;
    } else {
        /* Vendor: one vendor-class interface, EP0 control + EP1 bulk in/out. */
        ii.interface_count = 1;
        ii.interface[0] = 0;
        ii.interface_class[0] = 0xFF;      /* vendor-specific */
        ii.interface_subclass[0] = 0;
        ii.interface_protocol[0] = 0;
        ei.type[1]  = usb_redir_type_bulk; ei.max_packet_size[1]  = bulk_mps;
        ei.type[17] = usb_redir_type_bulk; ei.max_packet_size[17] = bulk_mps;
        ei.interface[1] = ei.interface[17] = 0;
    }
    usbredirparser_send_interface_info(s->parser, &ii);
    usbredirparser_send_ep_info(s->parser, &ei);

    /*
     * Descriptors are sourced from firmware via forwarded control
     * transfers, so the connect header carries only the speed; the host
     * learns class/ids from the real GET_DESCRIPTOR responses.
     */
    dc.speed = speed;
    usbredirparser_send_device_connect(s->parser, &dc);
    usbredirparser_do_write(s->parser);
}

void mcxn_usbdev_detach(MCXNUsbDevState *s)
{
    s->attached = false;
    memset(s->pending, 0, sizeof(s->pending));
    if (s->parser && s->connected) {
        usbredirparser_send_device_disconnect(s->parser);
        usbredirparser_do_write(s->parser);
    }
}

/* Backend retired a primed IN descriptor that answers a pending host IN. */
void mcxn_usbdev_complete_in(MCXNUsbDevState *s, int ep,
                             const uint8_t *buf, int len)
{
    uint8_t ep_addr = (ep & 0x0f) | 0x80;
    MCXNUsbPending *p = usbdev_pending(s, ep_addr);

    if (!p->active || !s->parser) {
        return;
    }
    if (len > p->length) {
        len = p->length;
    }

    if (p->is_control) {
        struct usb_redir_control_packet_header ch = { 0 };
        ch.endpoint = ep_addr;
        ch.status = usb_redir_success;
        ch.length = len;
        usbredirparser_send_control_packet(s->parser, p->id, &ch,
                                           (uint8_t *)buf, len);
    } else {
        struct usb_redir_bulk_packet_header bh = { 0 };
        bh.endpoint = ep_addr;
        bh.status = usb_redir_success;
        bh.length = len & 0xffff;
        bh.length_high = len >> 16;
        usbredirparser_send_bulk_packet(s->parser, p->id, &bh,
                                        (uint8_t *)buf, len);
    }
    p->active = false;
    usbredirparser_do_write(s->parser);
}

/* Backend retired a primed OUT descriptor that answers a pending host OUT. */
void mcxn_usbdev_complete_out(MCXNUsbDevState *s, int ep, int status, int len)
{
    uint8_t ep_addr = ep & 0x0f;
    MCXNUsbPending *p = usbdev_pending(s, ep_addr);
    uint8_t st = (status == MCXN_USB_XFER_OK) ? usb_redir_success
                                              : usb_redir_stall;

    if (!p->active || !s->parser) {
        return;
    }
    if (p->reply_kind == MCXN_USB_REPLY_CONFIG) {
        /*
         * Deferred SET_CONFIGURATION ack — firmware just ran the status
         * stage.
         */
        struct usb_redir_configuration_status_header cs = { 0 };
        cs.status = st;
        cs.configuration = p->arg0;
        usbredirparser_send_configuration_status(s->parser, p->id, &cs);
    } else if (p->reply_kind == MCXN_USB_REPLY_ALT) {
        /* Deferred SET_INTERFACE ack. */
        struct usb_redir_alt_setting_status_header as = { 0 };
        as.status = st;
        as.interface = p->arg0;
        as.alt = p->arg1;
        usbredirparser_send_alt_setting_status(s->parser, p->id, &as);
    } else if (p->is_control) {
        struct usb_redir_control_packet_header ch = { 0 };
        ch.endpoint = ep_addr;
        ch.status = st;
        ch.length = len & 0xffff;
        usbredirparser_send_control_packet(s->parser, p->id, &ch, NULL, 0);
    } else {
        struct usb_redir_bulk_packet_header bh = { 0 };
        bh.endpoint = ep_addr;
        bh.status = st;
        /*
         * Report the actual transferred byte count: a real OUT-endpoint
         * driver (e.g. cdc_acm's tty write) reads this and treats 0 as a
         * short write.
         */
        bh.length = len & 0xffff;
        bh.length_high = (len >> 16) & 0xffff;
        usbredirparser_send_bulk_packet(s->parser, p->id, &bh, NULL, 0);
    }
    p->active = false;
    p->reply_kind = MCXN_USB_REPLY_XFER;
    usbredirparser_do_write(s->parser);
}

/*
 * ------------------------------------------------------------------------- *
 * QOM.
 * ------------------------------------------------------------------------- *
 */

static void mcxn_usbdev_realize(DeviceState *dev, Error **errp)
{
    MCXNUsbDevState *s = MCXN_USBDEV(dev);

    if (qemu_chr_fe_backend_connected(&s->cs)) {
        qemu_chr_fe_set_handlers(&s->cs, usbdev_chr_can_read, usbdev_chr_read,
                                 usbdev_chr_event, NULL, s, NULL, true);
    }
}

static void mcxn_usbdev_unrealize(DeviceState *dev)
{
    MCXNUsbDevState *s = MCXN_USBDEV(dev);

    usbdev_destroy_parser(s);
}

static const Property mcxn_usbdev_props[] = {
    DEFINE_PROP_CHR("chardev", MCXNUsbDevState, cs),
    DEFINE_PROP_STRING("gadget-profile", MCXNUsbDevState, gadget_profile),
};

static void mcxn_usbdev_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_usbdev_realize;
    dc->unrealize = mcxn_usbdev_unrealize;
    device_class_set_props(dc, mcxn_usbdev_props);
    /* No user-creatable: the SoC instantiates and links it to a backend. */
    dc->user_creatable = false;
}

static const TypeInfo mcxn_usbdev_types[] = {
    {
        .name          = TYPE_MCXN_USBDEV,
        .parent        = TYPE_DEVICE,
        .instance_size = sizeof(MCXNUsbDevState),
        .class_init    = mcxn_usbdev_class_init,
    },
};

DEFINE_TYPES(mcxn_usbdev_types)
